---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem.AnalyticalSystemDomain
source: html/476d84d6-6569-5035-fdaa-c2e9197532a7.htm
---
# Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem.AnalyticalSystemDomain Property

The type of analytical system.

## Syntax (C#)
```csharp
public AnalyticalSystemDomain AnalyticalSystemDomain { get; }
```